---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NoRelatedWarnings
source: html/56b7220c-c806-ad7f-45da-8b8b390813b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NoRelatedWarnings Property

Document doesn't contain any warnings related to these elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRelatedWarnings { get; }
```